# Preparación de datos.

Como primer paso, importamos las librerias

In [1]:
import pandas as pd
import numpy as np
import json

Una vez que abrimos nuestras librerias pasamos a abrir el archivo csv

In [2]:
df = pd.read_csv("C:/Users/Lenovo/Desktop/Septimo semestre/Mineria de datos/Mall_Customers.csv",encoding='utf8')

# Limpieza de datos

Una vez cargada nuestra base de datos pasamos al objetivo de limpiar nuestros datos

In [3]:
df.shape

(200, 5)

Usamos df.shape para saber cuantas columnas y renglones tenemos

In [4]:
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

Usamos df.head para visualizar los primeros 5 datos de mi base de datos

In [5]:
df.tail()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

Usamos df.tail para obsservar los ultimos 5 datos de mi base de datos

In [6]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

Usamos df.colums para visualizar mejor las columnas

In [7]:
data_frame=df.rename(columns = {'Annual Income (k$)':'Ingresos anuales(Miles dls)','CustomerID':'ID','Gender':'Sexo','Age':'Edad','Spending Score (1-100)':'Puntaje de compras(1-100)'})

Usamos df.rename para cambiar el nombre de las columnas dado a que estaba en ingles y se puede visualizar mejor al español

In [8]:
data_frame

      ID    Sexo  Edad  Ingresos anuales(Miles dls)  Puntaje de compras(1-100)
0      1    Male    19                           15                         39
1      2    Male    21                           15                         81
2      3  Female    20                           16                          6
3      4  Female    23                           16                         77
4      5  Female    31                           17                         40
..   ...     ...   ...                          ...                        ...
195  196  Female    35                          120                         79
196  197  Female    45                          126                         28
197  198    Male    32                          126                         74
198  199    Male    32                          137                         18
199  200    Male    30                          137                         83

[200 rows x 5 columns]

In [9]:
data_frame.dtypes

ID                              int64
Sexo                           object
Edad                            int64
Ingresos anuales(Miles dls)     int64
Puntaje de compras(1-100)       int64
dtype: object

Usamos df.dtypes para visualizar el tipo de datos que tiene cada una de mis columnas

In [10]:
data_frame.Edad.unique()

array([19, 21, 20, 23, 31, 22, 35, 64, 30, 67, 58, 24, 37, 52, 25, 46, 54,
       29, 45, 40, 60, 53, 18, 49, 42, 36, 65, 48, 50, 27, 33, 59, 47, 51,
       69, 70, 63, 43, 68, 32, 26, 57, 38, 55, 34, 66, 39, 44, 28, 56, 41],
      dtype=int64)

In [11]:
EdadO=data_frame.Edad.unique()

In [12]:
EdadO.sort()

Usamos Edad0.sort() para ordenar mis datos

In [13]:
EdadO

array([18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 63, 64, 65, 66, 67, 68, 69, 70],
      dtype=int64)

Y asi podemos ver que la edad de nuestros clientes abarcan en los intervalos [18-70]

### Ahora visualizaremos los datos nulos

In [14]:
data_frame.isnull()

,ID,Sexo,Edad,Ingresos anuales(Miles dls),Puntaje de compras(1-100)
0,False,False,False,False,False
1,False,False,False,False,False
2,False,False,False,False,False
3,False,False,False,False,False
4,False,False,False,False,False
...,...,...,...,...,...
195,False,False,False,False,False
196,False,False,False,False,False
197,False,False,False,False,False
198,False,False,False,False,False
199,False,False,False,False,False

In [15]:
data_frame.isnull().any()

ID                             False
Sexo                           False
Edad                           False
Ingresos anuales(Miles dls)    False
Puntaje de compras(1-100)      False
dtype: bool

Y como podemos observar nuestra base de datos no contiene datos nulos

In [16]:
data_frame.isnull().sum()

ID                             0
Sexo                           0
Edad                           0
Ingresos anuales(Miles dls)    0
Puntaje de compras(1-100)      0
dtype: int64